# By including these lines in my Brewfile, I can easily install these applications with a single command.

# brew tap homebrew/bundle
# brew bundle --file ./Brewfile

# TAPS
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# 'brew install'
brew 'autojump'
brew 'mackup' # # Backup and restore app settings on macOS
brew 'mas' # Mac App Store manager
brew 'zsh'
brew 'bat' # Improved cat command
brew 'gh' # GitHub CLI
brew 'jq' # JSON parser
brew 'git'
brew 'wget' # Download files from the web
brew 'pyenv' # Python version manager
brew 'pnpm'
brew 'nvm'
brew 'k9s'
brew 'grep'


# 'brew install --cask'
cask 'docker'
cask 'font-agave-nerd-font'
cask 'gitkraken'
cask 'jetbrains-toolbox'
cask 'visual-studio-code'
cask 'sublime-text'
cask 'spotify'
cask 'raycast'
cask 'rectangle'
cask 'arc'
cask 'google-chrome'
cask 'devcleaner'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'notion'
cask 'postman'
cask 'hyper'
cask 'warp'
cask 'google-drive'
cask 'chatgpt'

# Quicklook
cask 'qlmarkdown' # $ xattr -r -d com.apple.quarantine "FULL PATH OF THE QLMarkdown.app (you can drag the file to get the pull path)" - https://github.com/sbarex/QLMarkdown
cask 'quicklook-json'
cask 'quicklook-csv'

# Mac App Store
mas 'Xcode', id: 497799835
mas 'Dropover - Easier Drag & Drop', id: 1355679052 # Drag and drop files easily
mas 'Usage: System Activity Monitor', id: 1561788435 # System monitor in the menu bar

# Command to search for available casks
# brew search --casks "" | less
